console.log ('Завдання №2'); //За допомогою оператора type of виведіть результат опрацювання всіх типів даних які були розглянуті на лекції.
console.log (typeof 123);
console.log (typeof 10n);
console.log (typeof 'hello');
console.log (typeof false);
console.log (typeof undefined);
console.log (typeof null); //історична помилка JS
console.log (typeof Symbol());
console.log (typeof []);
console.log (typeof {});
/* Поясніть різницю між undefined, null та 0
undefined - це тип даних, який вказує на те, що змінна була оголошена, але не має присвоєного значення (стан за замовчуванням)
null - це спеціальне значення, яке вказує на відсутність будь-якого об'єкта або значення (наприклад хтось навмисно очистив змінну або вказав, що значення відсутнє)
0 - це повноцінне математичне значення, а не порожнеча 
Вони всі різні типи даних і мають різні значення та призначення. */

console.log ('\nЗавдання №3'); 
console.log (Number ('0')); //3.1 Дано перелік коротких рядків: "0", "123", "". Використайте приведення типів та перетворіть рядки в тип number
console.log (Number ('123'));
console.log (Number (''));
console.log ('\n' + Boolean (0)); //3.2 Дано перелік значень 0, 1, -1, null, undefined. Використайте приведення типів та перетворіть значення в логічний тип даних
console.log (Boolean (1));
console.log (Boolean (-1));
console.log (Boolean (null));
console.log (Boolean (undefined));

console.log ('\nЗавдання №4');
console.log ("5" + 2) //4.1 Виведіть результат виконання операцій в консоль та подумайте над результатом
console.log ("5" - 2)
console.log (true + 1)
console.log (false + "1")
console.log (null + 1)
function sum(a, b) { //4.2 Напишіть алгоритм перевірки даних та, за необхідності, додайте приведення типів для отримання правильного результату виконання операцій
    let num1 = Number (a);
    let num2 = Number (b);
    console.log (num1 + num2);
}
sum ("5", 2);
sum ("5", -2);
sum (true, 1);
sum (false, "1");
sum (null, 1);

console.log ('\nЗавдання №5');
console.log (0 == false) //Використайте строге та нестроге порівняння значень. Пояснити різницю, переваги та недоліки порівнянь.
console.log (0 === false)
console.log ('' == false)
console.log ('' === false)
console.log (null == undefined)
console.log (null === undefined)
console.log ('5' == 5)
console.log ('5' === 5)
/* Нестроге порівняння (==) автоматично зводить типи до числа, дозволяючи порівнювати різні за типом значення, що часто спричиняє баги через неочевидні перетворення.
Строге порівняння (===) порівнює значення та їх типи без перетворень, забезпечуючи максимальну передбачуваність, швидкість виконання та чистоту коду. */

console.log ('\nЗавдання №6');
let arr = [1, 4, 'hi', 16, 'hello world', [1, 2, 3]]; // Створити масив на 6 значень, значення обрати випадково
console.log (arr[1]); // Виведіть в консоль звернення до 2 та 5 значення масиву
console.log (arr[4]); 
arr[2] = 'bye'; // Змініть 3 елемент масиву та виведіть результат в консоль
console.log (arr); 
console.log (arr.length); 
console.log (typeof arr); 
console.log (Array.isArray(arr)); // Перевірити тип масиву через Array.isArray() та пояснити результат

console.log ('\nЗавдання №7');
let student = { //Створіть об’єкт студент. У властивостях об’єкту за замовчуванням передбачте поля: ім’я, прізвище, рік народження, навчальний заклад, статус.
    firstName: 'Глорія',
    lastName: 'Пачковська',
    birthYear: 2008,
    university: 'КНУ ім. Тараса Шевченка',
    status: 'активний'
}
console.log (student.firstName); // Зверніться до властивостей об’єкта через крапку та через квадратні дужки. Поясніть результат виведення в консоль.
console.log (student['lastName']); 
student.scholarship = true; //Додайте в об’єкт властивість стипендія з логічних значенням
console.log (student);
student.scholarship = !student.scholarship; //Після додавання зверніться до властивості стипендія та змініть значення на протилежне
console.log (student.scholarship);
delete student.status; // Видаліть одну з властивостей на вибір та продемонструйте результат
console.log (student);

console.log ('\nЗавдання №8'); //Створіть масив числових значень розміром 10 елементів в довільному порядку, з яких 4 повторюються
let arr2 = [1, 3, 4, 8, 16, 16, 7, 9, 8, 5];
let sortedArr2 = [...new Set(arr2)].sort((a, b) => a - b); // Проведіть сортування масиву та видаліть з нього дублікати
console.log (sortedArr2);

/* Завдання 9*:
1. Використовуючи коментарі – відділіть завдання у js-файлі та зробіть 
нотатки яка частина коду до якого завдання належить.
2. Напишіть на початку кожного завдання виведення в консоль номеру цього 
завдання */